In [32]:
import pandas as pd
import numpy as np

basics_url = ('https://datasets.imdbws.com/title.basics.tsv.gz')

ratings_url = ('https://datasets.imdbws.com/title.ratings.tsv.gz')

akas_url = ('https://datasets.imdbws.com/title.akas.tsv.gz')

basics = pd.read_csv(basics_url,sep='\t', low_memory = False)
ratings = pd.read_csv(ratings_url,sep='\t', low_memory = False)
akas = pd.read_csv(akas_url,sep='\t', low_memory = False)

In [33]:
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"

In [34]:
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1905
1  tt0000002            5.9       256
2  tt0000003            6.5      1702
3  tt0000004            5.7       168
4  tt0000005            6.2      2517

In [35]:
akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,1,Карменсіта,UA,\N,imdbDisplay,\N,0
1,tt0000001,2,Carmencita,DE,\N,\N,literal title,0
2,tt0000001,3,Carmencita - spanyol tánc,HU,\N,imdbDisplay,\N,0
3,tt0000001,4,Καρμενσίτα,GR,\N,imdbDisplay,\N,0
4,tt0000001,5,Карменсита,RU,\N,imdbDisplay,\N,0

In [36]:
basics = basics.replace({'\\N':np.nan})

In [37]:
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,NaN,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,NaN,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,NaN,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,NaN,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,NaN,1,"Comedy,Short"

In [38]:
ratings = ratings.replace({'\\N':np.nan})

In [39]:
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1905
1  tt0000002            5.9       256
2  tt0000003            6.5      1702
3  tt0000004            5.7       168
4  tt0000005            6.2      2517

In [40]:
akas = akas.replace({'\\N':np.nan})

In [41]:
akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,1,Карменсіта,UA,NaN,imdbDisplay,NaN,0
1,tt0000001,2,Carmencita,DE,NaN,NaN,literal title,0
2,tt0000001,3,Carmencita - spanyol tánc,HU,NaN,imdbDisplay,NaN,0
3,tt0000001,4,Καρμενσίτα,GR,NaN,imdbDisplay,NaN,0
4,tt0000001,5,Карменсита,RU,NaN,imdbDisplay,NaN,0

In [42]:
basics.isna().sum()

tconst                  0
titleType               0
primaryTitle           10
originalTitle          10
isAdult                 1
startYear         1211750
endYear           9051568
runtimeMinutes    6687469
genres             415993
dtype: int64

In [43]:
basics.dropna(subset = ['runtimeMinutes', 'genres'], inplace = True)

In [44]:
basics.isna().sum()

tconst                  0
titleType               0
primaryTitle            1
originalTitle           1
isAdult                 0
startYear           36235
endYear           2347020
runtimeMinutes          0
genres                  0
dtype: int64

In [45]:
basics['titleType'].value_counts()

tvEpisode       1061223
short            573075
movie            366213
video            174752
tvMovie           88212
tvSeries          86367
tvSpecial         16429
tvMiniSeries      16004
tvShort            9372
videoGame           294
Name: titleType, dtype: int64

In [46]:
movie_filter = basics['titleType'] == 'movie'
movie_filter.value_counts()

False    2025728
True      366213
Name: titleType, dtype: int64

In [47]:
basics = basics.loc[movie_filter,:]

In [48]:
basics['titleType'].head()

8       movie
570     movie
587     movie
672     movie
1172    movie
Name: titleType, dtype: object

In [49]:
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
8,tt0000009,movie,Miss Jerry,Miss Jerry,0,1894,NaN,45,Romance
570,tt0000574,movie,The Story of the Kelly Gang,The Story of the Kelly Gang,0,1906,NaN,70,"Action,Adventure,Biography"
587,tt0000591,movie,The Prodigal Son,L'enfant prodigue,0,1907,NaN,90,Drama
672,tt0000679,movie,The Fairylogue and Radio-Plays,The Fairylogue and Radio-Plays,0,1908,NaN,120,"Adventure,Fantasy"
1172,tt0001184,movie,Don Juan de Serrallonga,Don Juan de Serrallonga,0,1910,NaN,58,"Adventure,Drama"

In [50]:
basics['startYear'].value_counts()

2017    14179
2018    14117
2016    13806
2019    13787
2015    13320
        ...
1894        1
1899        1
1904        1
1906        1
1896        1
Name: startYear, Length: 129, dtype: int64

In [51]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 366213 entries, 8 to 9146629
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          366213 non-null  object
 1   titleType       366213 non-null  object
 2   primaryTitle    366213 non-null  object
 3   originalTitle   366213 non-null  object
 4   isAdult         366213 non-null  object
 5   startYear       360420 non-null  object
 6   endYear         0 non-null       object
 7   runtimeMinutes  366213 non-null  object
 8   genres          366213 non-null  object
dtypes: object(9)
memory usage: 27.9+ MB

In [52]:
basics['startYear'].isna().sum()

5793

In [53]:
basics.dropna(subset = ['startYear'], inplace= True)

In [54]:
basics['startYear'].isna().sum()

0

In [58]:
basics['startYear'] = basics['startYear'].astype(int)

In [60]:
basics['runtimeMinutes'] = basics['runtimeMinutes'].astype(int)

In [61]:
basics.dtypes

tconst            object
titleType         object
primaryTitle      object
originalTitle     object
isAdult           object
startYear          int32
endYear           object
runtimeMinutes     int32
genres            object
dtype: object

In [62]:
startYear_filter = basics['startYear'] > 1999

In [63]:
basics = basics.loc[startYear_filter,:]

In [65]:
basics['startYear'].head(20)

13079     2021
34790     2001
61087     2020
66301     2006
67632     2018
77926     2001
86763     2005
87075     2001
90878     2004
92728     2016
93899     2002
98002     2017
100035    2000
102615    2021
106067    2004
106674    2002
107951    2006
108872    2018
110326    2002
110438    2000
Name: startYear, dtype: int32

In [66]:
is_documentary = basics['genres'].str.contains('documentary',case=False)
basics = basics[~is_documentary]

In [70]:
basics['genres'].head()

34790    Comedy,Fantasy,Romance
61087                     Drama
67632                     Drama
77926                 Drama,War
86763      Comedy,Horror,Sci-Fi
Name: genres, dtype: object

In [71]:
keepers =basics['tconst'].isin(akas['titleId'])
keepers

34790      True
61087      True
67632      True
77926      True
86763      True
           ...
9146351    True
9146360    True
9146399    True
9146444    True
9146528    True
Name: tconst, Length: 142315, dtype: bool

In [72]:
basics = basics[keepers]
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
34790,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
61087,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
67632,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
77926,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140,"Drama,War"
86763,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
...,...,...,...,...,...,...,...,...,...
9146351,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama
9146360,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller"
9146399,tt9916270,movie,Il talento del calabrone,Il talento del calabrone,0,2020,NaN,84,Thriller
9146444,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History"
9146528,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019,NaN,123,Drama